Layer (type)                 Output Shape              Param #   
=================================================================
image_array (Conv2D)         (None, 48, 48, 16)        800       
_________________________________________________________________
batch_normalization_61 (Batc (None, 48, 48, 16)        64        
_________________________________________________________________
conv2d_69 (Conv2D)           (None, 48, 48, 32)        25120     
_________________________________________________________________
batch_normalization_62 (Batc (None, 48, 48, 32)        128       
_________________________________________________________________
activation_27 (Activation)   (None, 48, 48, 32)        0         
_________________________________________________________________
average_pooling2d_29 (Averag (None, 24, 24, 32)        0         
_________________________________________________________________
dropout_25 (Dropout)         (None, 24, 24, 32)        0         
_________________________________________________________________
conv2d_70 (Conv2D)           (None, 24, 24, 64)        51264     
_________________________________________________________________
batch_normalization_63 (Batc (None, 24, 24, 64)        256       
_________________________________________________________________
conv2d_71 (Conv2D)           (None, 24, 24, 64)        102464    
_________________________________________________________________
batch_normalization_64 (Batc (None, 24, 24, 64)        256       
_________________________________________________________________
activation_28 (Activation)   (None, 24, 24, 64)        0         
_________________________________________________________________
average_pooling2d_30 (Averag (None, 12, 12, 64)        0         
_________________________________________________________________
dropout_26 (Dropout)         (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_72 (Conv2D)           (None, 12, 12, 64)        36928     
_________________________________________________________________
batch_normalization_65 (Batc (None, 12, 12, 64)        256       
_________________________________________________________________
conv2d_73 (Conv2D)           (None, 12, 12, 128)       73856     
_________________________________________________________________
batch_normalization_66 (Batc (None, 12, 12, 128)       512       
_________________________________________________________________
activation_29 (Activation)   (None, 12, 12, 128)       0         
_________________________________________________________________
average_pooling2d_31 (Averag (None, 6, 6, 128)         0         
_________________________________________________________________
dropout_27 (Dropout)         (None, 6, 6, 128)         0         
_________________________________________________________________
conv2d_74 (Conv2D)           (None, 6, 6, 128)         147584    
_________________________________________________________________
batch_normalization_67 (Batc (None, 6, 6, 128)         512       
_________________________________________________________________
conv2d_75 (Conv2D)           (None, 6, 6, 256)         295168    
_________________________________________________________________
batch_normalization_68 (Batc (None, 6, 6, 256)         1024      
_________________________________________________________________
activation_30 (Activation)   (None, 6, 6, 256)         0         
_________________________________________________________________
average_pooling2d_32 (Averag (None, 3, 3, 256)         0         
_________________________________________________________________
dropout_28 (Dropout)         (None, 3, 3, 256)         0         
_________________________________________________________________
conv2d_76 (Conv2D)           (None, 3, 3, 256)         590080    
_________________________________________________________________
batch_normalization_69 (Batc (None, 3, 3, 256)         1024      
_________________________________________________________________
conv2d_77 (Conv2D)           (None, 3, 3, 8)           18440     
_________________________________________________________________
global_average_pooling2d_4 ( (None, 8)                 0         
_________________________________________________________________
predictions (Activation)     (None, 8)                 0         
=================================================================
Total params: 1,345,736
Trainable params: 1,343,720
Non-trainable params: 2,016